---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.BeamFailures
source: html/aef6a8d4-acc6-86b5-e6a6-9e6aa34e2a87.htm
---
# BuiltInFailures.BeamFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.